{"data":{"allMarkdownRemark":{"nodes":[{"frontmatter":{"date":"Feb 18, 2021","title":"What is Web Analytics?","tags":["Web Analytics"],"description":"What is Web Analytics?","readTime":3,"image":{"childImageSharp":{"fixed":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAALCAIAAADwazoUAAAACXBIWXMAAAsSAAALEgHS3X78AAACNklEQVQoz02Sa2/aMBSG88c3aZqEVE1VP5CpVbd1BbVTV2hLuZS2ghIgd0IC9IaBJDjhEhJ6EaMrK4k9A/sw6ZV9jvU+58jHpkQHE0nuch1h1p6FwuEQTW98232/Flrb3KL3Dz+sf9pN52UXC0Mkjha2FUUttiEqmxPRQSQWBj5J+f78EvrcMJAGcwLwg4CcCIOA9ODglIXTFb+EHVTqPEhOIC+rEimjIAr8I/0t30Oqi5QRIm3lEZIczFq/Wfgi/g+L7oJJmEHeDojjJ8RfgU+rLzsGPu7hTJ94gqz5J9nFqodWd1zBSBr6goe/SzDMwbiNczZKXcSLyQ0mFS6k6EJi/ewqydRB7DS2C/yk8Va2Z8KiM6IqY1xw8WF7HlXdPc2LXE/3G0+WmvFbyVeQnoG03071atkfirWdV3Za+HOGobPc1QOuuAHFAzvOsHuKxXftXNsq6PZVE3ahiV/76FlHTzpGUwiNA1Y7rFsHSutYbmyWW1n1WjTHlGBPz4TKO7ZLl9UI6H8xnzLdx26j9HpzNGkQxWe3R0Ar3pnWHGOE0Bz76Xs3lo0JwKCKdT2STG8n8qOtj87QueVPK1X5UgPcdYtXqpxSZW87OVG90O5jxpTvPTPwMaZ0osX6udqh8pW7OCMyYNxs2zXrWb7rlJv94+Yk0ZxkajBdgwnw6+TGu6zp5zUjoxm5un6mGUxzUOqMKXmMq49Y8jBHPhCZobeIFSIXk1kSkYCk8vhfKnu4svSQB/sLbokmcyD/XXMAAAAASUVORK5CYII=","width":890,"height":500,"src":"/static/77de0cedf7aafa361ca2d66d5c7215d4/0c48f/web_analytics.png","srcSet":"/static/77de0cedf7aafa361ca2d66d5c7215d4/0c48f/web_analytics.png 1x"}}}},"fields":{"slug":"webAnalytics/about-web-analytics"},"rawMarkdownBody":"\n## What Is Web Analytics\nWeb analytics is the measurement and analysis of data to inform an understanding of user behavior across web pages.\n\nAnalytics platforms measure activity and behavior on a website, for example: how many users visit, how long they stay, how many pages they visit, which pages they visit, and whether they arrive by following a link or not.\n\nBusinesses use web analytics platforms to measure and benchmark site performance and to look at key performance indicators that drive their business, such as purchase conversion rate.\n\n##\n![](./web_analytics.png)\n\n## Why Web Analytics Are Important\nThere’s an old business adage that whatever is worth doing is worth measuring.\n\nWebsite analytics provide insights and data that can be used to create a better user experience for website visitors.\n\nUnderstanding customer behavior is also key to optimizing a website for key conversion metrics.\n\nFor example, web analytics will show you the most popular pages on your website, and the most popular paths to purchase.\n\nWith website analytics, you can also accurately track the effectiveness of your online marketing campaigns to help inform future efforts.\n\n## How Web Analytics Work\nMost analytics tools ‘tag’ their web pages by inserting a snippet of JavaScript in the web page’s code.\n\nUsing this tag, the analytics tool counts each time the page gets a visitor or a click on a link. The tag can also gather other information like device, browser and geographic location (via IP address).\n\nWeb analytics services may also use cookies to track individual sessions and to determine repeat visits from the same browser.\n\nSince some users delete cookies, and browsers have various restrictions around code snippets, no analytics platform can claim full accuracy of their data and different tools sometimes produce slightly different results.\n\n## Sample Web Analytics Data\nWeb analytics data is typically presented in dashboards that can be customized by user persona, date range, and other attributes. Data is broken down into categories, such as:\n\n##\n#### Audience Data\n\n* number of visits, number of unique visitors\n* new vs. returning visitor ratio\n* what country they are from\n* what browser or device they are on (desktop vs. mobile)\n\n##\n#### Audience Behavior\n\n* common landing pages\n* common exit page\n* frequently visited pages\n* length of time spent per visit\n* number of pages per visit\n* bounce rate\n\n##\n## The following are some of the most commonly used tools:\n\n* Google Analytics - the ‘standard’ website analytics tool, free and widely used\n* Piwik - an open-source solution similar in functionality to Google and a popular alternative, allowing companies full ownership and control of their data\n* Adobe Analytics - highly customizable analytics platform (Adobe bought analytics leader Omniture in 2009)\n* Kissmetrics - can zero in on individual behavior, i.e. cohort analysis, conversion and retention at the segment or individual level\n* Mixpanel - advanced mobile and web analytics that measure actions rather than pageviews\n* Parse.ly - offers detailed real-time analytics, specifically for publishers\n* CrazyEgg - measures which parts of the page are getting the most attention using ‘heat mapping’\n* Clicktale - uses ‘heat mapping,’ keystrokes and mouse movement\n\n#\nWith a wide variety of analytics tools on the market, the right vendors for your company’s needs will depend on your specific requirements. Luckily, Optimizely integrates with most of the leading platforms to simplify your data analysis."}]}}}